//------------------------------------------------------------------------------------------------------------------------
#ifndef __mtdTHRESHOLD_H
#define __mtdTHRESHOLD_H
//------------------------------------------------------------------------------------------------------------------------
#include "../MDS/MDS.h"
//------------------------------------------------------------------------------------------------------------------------
// class mtdTHRESHOLD
//------------------------------------------------------------------------------------------------------------------------
class mtdTHRESHOLD
{
public: ///< Key size definition
	static int KeySize_PK;		///< RC_GROUP + IB + ACCOUNT
 public: ///< Index Object pointer
	static MDS::MIndexObjectMultiple*	IndexObj_KEY1;	///< RC_GROUP + IB
public: ///< Filed number definition
	static const int RC_GROUP          = 0;		///< 群組
	static const int IB                = 1;		///< 分支別
	static const int ACCOUNT           = 2;		///< 客戶帳號
	static const int FLAG              = 3;		///< 水位旗標
	static const int CAN_ORDER         = 4;	        ///< 可下單保證金
	static const int RISK_RATE         = 5;         ///< 全帳戶風險比率
};
//------------------------------------------------------------------------------------------------------------------------
#endif
//------------------------------------------------------------------------------------------------------------------------
